In [144]:
import numpy as np
import pandas as pd
import random
np.random.seed(101)

In [146]:
df = pd.DataFrame(np.random.randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [120]:
# df.columns
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df.shape

In [ ]:
df.W
# df['W']
# df[['W','X']]
# df['new'] = df['X'] + df.W

In [ ]:
df.drop('new', axis=1, inplace=True)
df.drop('E')
df

In [ ]:
# df.loc['B']
df.loc[['B','E'],['X','Y']]
# df.loc['B':'E','Y':]

In [ ]:
df.iloc[1]
# df.iloc[[1,4],[1,3]]
# df.iloc[1:,2:]

In [ ]:
df[df.W>0]['X']

In [ ]:
# df[ (df['W'] > 0) & (df['X']>0)]  # and operator
df[ (df['W'] > 0) | (df['X']>0)]    # Or operator

In [ ]:
df.reset_index()

In [ ]:
df['States'] = 'CA NY WY OR CR'.split()
df

In [ ]:
df.set_index('States')

In [ ]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

In [ ]:
df2 = pd.DataFrame(np.random.randn(6,2), hier_index, ['A','B'])
df2

In [ ]:
df2.loc['G1'].loc[1]

In [ ]:
df2.index.names = ['Group','Num']
df2

In [ ]:
df2.loc['G1'].loc[3]['B']

In [ ]:
# df2.xs('G1')
df2.xs(1, level='Num') # Cross Section

In [ ]:
d = {'A':[1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)
df

In [ ]:
# df.dropna(axis=0)
# df.dropna(axis=1)
df.dropna(thresh=2)

In [ ]:
# df.fillna(value='nn')
df['A'].fillna(value= df['A'].mean())

# Group By

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person' :['Sam','Charlie','Amy','Venan','Carl','Sarah'],
        'Sales'  :[200, 120, 340, 124, 243, 350] }
df3 = pd.DataFrame(data)
df3

In [ ]:
# CompGroup = df3.groupby('Company')
# CompGroup.mean()
# CompGroup.sum()
# CompGroup.sum().loc['FB']
# df3.groupby('Company').count()
df3.groupby('Company').describe().transpose()

# Operations

In [109]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [110]:
# df['col2'].unique()
len(df['col2'].unique())
# df['col2'].nunique()

3

In [111]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [114]:
def times2(x):
    return x*2

In [117]:
# df['col1'].sum()
# df['col1'].apply(times2)
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [118]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [122]:
df.sort_values('col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [129]:
df.isnull()
~df.isnull()

   col1  col2  col3
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True

In [131]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [135]:
df_pt = df.pivot_table(values='D',index=['A','B'], columns='C')

In [136]:
df_pt
# df_pt.xs('one',level='B')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Joining, Mergine and Concat

In [141]:
df1 = pd.DataFrame({'A': 'A0 A1 A2 A3'.split(),
                    'B': 'B0 B1 B2 B3'.split(),
                    'C': 'C0 C1 C2 C3'.split(),
                    'D': 'D0 D1 D2 D3'.split()},
                  index=[0,1,2,3])

df2 = pd.DataFrame({'A': 'A4 A5 A6 A7'.split(),
                    'B': 'B4 B5 B6 B7'.split(),
                    'C': 'C4 C5 C6 C7'.split(),
                    'D': 'D4 D5 D6 D7'.split()},
                  index=[4,5,6,7])

df3 = pd.DataFrame({'A': 'A8 A9 A10 A11'.split(),
                    'B': 'B8 B9 B10 B11'.split(),
                    'C': 'C8 C9 C10 C11'.split(),
                    'D': 'D8 D9 D10 D11'.split()},
                  index=[8,9,10,11])

In [142]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [143]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [148]:
left = pd.DataFrame({'key': 'K0 K1 K2 K3'.split(),
                      'A':'A0 A1 A2 A3'.split(),
                      'B':'B0 B1 B2 B3'.split()})
right = pd.DataFrame({'key': 'K0 K1 K2 K3'.split(),
                      'C':'C0 C1 C2 C3'.split(),
                      'D':'D0 D1 D2 D3'.split()})

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [149]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [157]:
left = pd.DataFrame({'A':'A0 A1 A2'.split(),
                      'B':'B0 B1 B2'.split()},
                   index= 'K0 K1 K2'.split(),
                      )

right = pd.DataFrame({'C':'C0 C2 C3'.split(),
                      'D':'D0 D2 D3'.split()},
                    index= 'K0 K2 K3'.split())

In [158]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [159]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3